# Ex1 - Filtering and Sorting Data

This time we are going to pull data directly from the internet.
Special thanks to: https://github.com/justmarkham for sharing the dataset and materials.

### Step 1. Import the necessary libraries

In [39]:
import pandas as pd
import numpy as np

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv).

### Step 3. Assign it to a variable called chipo.

In [51]:
url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv'
df = pd.read_csv(url , sep='\t')

df.head(2)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39

### Step 4. How many products cost more than $10.00?

In [52]:
df['item_price'] = df['item_price'].apply(lambda x : float(x.split('$')[1]))

In [53]:
df[ (df['quantity'] == 1) & (df['item_price'] > 10.0)]['item_name'].nunique()

25

### Step 5. What is the price of each item? 
###### print a data frame with only two columns item_name and item_price

In [54]:
df.head(3)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39
1,1,1,Izze,[Clementine],3.39
2,1,1,Nantucket Nectar,[Apple],3.39

In [70]:
df[ df['quantity'] == 1].drop_duplicates(['item_name']).sort_values(by = ['item_price'] , ascending = False)[['item_name','item_price']].head(10)

                  item_name  item_price
606        Steak Salad Bowl       11.89
1229    Barbacoa Salad Bowl       11.89
1132    Carnitas Salad Bowl       11.89
7             Steak Burrito       11.75
168   Barbacoa Crispy Tacos       11.75
39            Barbacoa Bowl       11.75
738       Veggie Soft Tacos       11.25
186       Veggie Salad Bowl       11.25
62              Veggie Bowl       11.25
57           Veggie Burrito       11.25

In [71]:
# delete the duplicates in item_name and quantity
df1 = df.drop_duplicates(['item_name' , 'quantity'])

# select only the products with quantity equals to 1

df1 = df1[df1['quantity'] == 1]
# select only the item_name and item_price columns
df2 = df1[['item_name' , 'item_price']]

# sort the values from the most to less expensive
df2.sort_values(by = 'item_price' , ascending = False).head(10)

                  item_name  item_price
606        Steak Salad Bowl       11.89
1229    Barbacoa Salad Bowl       11.89
1132    Carnitas Salad Bowl       11.89
7             Steak Burrito       11.75
168   Barbacoa Crispy Tacos       11.75
39            Barbacoa Bowl       11.75
738       Veggie Soft Tacos       11.25
186       Veggie Salad Bowl       11.25
62              Veggie Bowl       11.25
57           Veggie Burrito       11.25

### Step 6. Sort by the name of the item

In [75]:
display(df.sort_values(by = 'item_name').head())
# OR

df.item_name.sort_values().head()

      order_id  quantity          item_name choice_description  item_price
3389      1360         2  6 Pack Soft Drink        [Diet Coke]       12.98
341        148         1  6 Pack Soft Drink        [Diet Coke]        6.49
1849       749         1  6 Pack Soft Drink             [Coke]        6.49
1860       754         1  6 Pack Soft Drink        [Diet Coke]        6.49
2713      1076         1  6 Pack Soft Drink             [Coke]        6.49

3389    6 Pack Soft Drink
341     6 Pack Soft Drink
1849    6 Pack Soft Drink
1860    6 Pack Soft Drink
2713    6 Pack Soft Drink
Name: item_name, dtype: object

### Step 7. What was the quantity of the most expensive item ordered?

In [77]:
# orderid = 1443
df.loc[df['item_price'].idxmax()]['quantity']

15

### Step 8. How many times was a Veggie Salad Bowl ordered?

In [79]:
df['item_name'].value_counts()['Veggie Salad Bowl']

18

### Step 9. How many times did someone order more than one Canned Soda?

In [83]:
df[(df['item_name'] == 'Canned Soda') & (df['quantity'] > 1)].shape[0]

20